src/app/controllers/concerns/boards_controller.rb

INSERT INTO `boards` (`name`, `title`, `body`, `created_at`, `updated_at`) VALUES ('ko', 'lo', 'to', '2021-01-15 02:20:19.157543', '2021-01-15 02:20:19.157543')
---
  def create
    board = Board.new(board_params)
    if board.save

UPDATE `boards` SET `boards`.`body` = 'Hello world!\r\ngood-bye world!', `boards`.`updated_at` = '2021-01-14 11:09:20.703734' WHERE `boards`.`id` = 1
---
  def update
    # view作成しないためローカル変数で可
    @board.update(board_params)

DELETE FROM `boards` WHERE `boards`.`id` = 3
---
  def destroy
    @board.delete

SELECT `boards`.* FROM `boards` WHERE `boards`.`id` = 1 LIMIT 1
---
  def set_target_board
    @board = Board.find(params[:id])