src/app/controllers/concerns/common_method.rb

  def current_user
    @current_user = User.find_by(id: session[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1