src/app/controllers/concerns/sessionable.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
  def current_user
    @current_user = User.find_by(id: session[:user_id])