src/app/controllers/application_controller.rb

  def current_user
    return unless session[:user_id]
    @current_user = User.find_by(id: session[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1