src/app/controllers/boards_controller.rb

SELECT COUNT(*) FROM `boards`
SELECT `boards`.* FROM `boards` LIMIT 25 OFFSET 0
---
  def index
      @boards = params[:tag_id].present? ? Tag.find(params[:tag_id]).boards : Board.all
      @boards = @boards.page(params[:page])

INSERT INTO `boards` (`name`, `title`, `body`, `created_at`, `updated_at`) VALUES ('hello', 'world', 'Hello world!', '2021-01-14 03:32:54.525337', '2021-01-14 03:32:54.525337')
---
  def create
    board = Board.new(board_params)
    # user_idを追加
    board.user = current_user
    binding.pry
    if board.save

UPDATE `boards` SET `boards`.`body` = 'Hello world!\r\ngood-bye world!', `boards`.`updated_at` = '2021-01-14 11:09:20.703734' WHERE `boards`.`id` = 1
---
  def update
    # view作成しないためローカル変数で可
    # @board.update(board_params)

    # redirect_to @board
    @board.user = current_user
    if @board.update(board_params)

DELETE FROM `boards` WHERE `boards`.`id` = 3
---
  def destroy
    @board.destroy

SELECT `boards`.* FROM `boards` WHERE `boards`.`id` = 3 LIMIT 1
---
  def set_target_board
    @board = Board.find(params[:id])